tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "lampepfl/brew"
cask "xquartz"
brew "pcre"
brew "python"
brew "imagemagick"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "bc"
brew "bfg"
brew "blueutil"
brew "boost"
brew "bzip2"
brew "cloc"
brew "coreutils"
brew "csvkit"
brew "curl"
brew "diffstat"
brew "diffutils"
brew "dos2unix"
brew "dvm"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "expect"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "gdb"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnumeric"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gpatch"
brew "grafana"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "haskell-stack"
brew "htop"
brew "httpie"
brew "hubflow"
brew "jenv"
brew "jq"
brew "less"
brew "libxslt"
brew "llvm@4"
brew "lsof"
brew "lua"
brew "luajit"
brew "mad"
brew "make"
brew "mas"
brew "moreutils"
brew "ncurses"
brew "nano"
brew "p7zip"
brew "poppler"
brew "pv"
brew "ripgrep"
brew "rsync"
brew "sbt"
brew "screen"
brew "sf-pwgen"
brew "shellcheck"
brew "sox"
brew "ssh-copy-id"
brew "tcpdump"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "zlib"
brew "zsh"
brew "lampepfl/brew/dotty"
cask "1password-cli"
cask "dbeaver-community"
cask "diffmerge"
cask "docker"
cask "drop-to-gif"
cask "firefox"
cask "gimp"
cask "gitter"
cask "google-chrome"
cask "google-chrome-canary"
cask "hyperswitch"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "libreoffice"
cask "licecap"
cask "meld"
cask "minikube"
cask "muzzle"
cask "osxfuse"
cask "postman"
cask "rq"
cask "signal"
cask "soapui"
cask "sourcetree"
cask "spectacle"
cask "squirrelsql"
cask "switchresx"
cask "textmate"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visualvm"
cask "vlc"
cask "vmware-fusion"
cask "vscodium"
