tap "argoproj/tap"
tap "azure/draft"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "lampepfl/brew"
tap "neovim/neovim"
cask "java"
cask "java8"
cask "xquartz"
brew "pcre"
brew "python"
brew "ansible"
brew "apache-spark"
brew "asciinema"
brew "imagemagick"
brew "avro-tools"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "bc"
brew "bfg"
brew "blueutil"
brew "boost"
brew "bzip2"
brew "cfssl"
brew "cloc"
brew "clojure"
brew "coreutils"
brew "csvkit"
brew "curl"
brew "diffstat"
brew "diffutils"
brew "dos2unix"
brew "dvm"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "emacs", args: ["with-cocoa"]
brew "expect"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "gdb"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnumeric"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gpatch"
brew "gradle"
brew "grafana"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "groovy"
brew "gzip"
brew "haskell-stack"
brew "heroku"
brew "htop"
brew "httpie"
brew "hubflow"
brew "jenv"
brew "jq"
brew "librdkafka"
brew "kafkacat"
brew "kubernetes-cli"
brew "kops"
brew "kubernetes-helm"
brew "leiningen"
brew "less"
brew "libxslt"
brew "llvm@4"
brew "lsof"
brew "lua"
brew "luajit"
brew "mad"
brew "make"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "minimesos"
brew "minio"
brew "minio-mc"
brew "moreutils"
brew "ncurses"
brew "nano"
brew "neovim"
brew "openconnect"
brew "p7zip"
brew "packer"
brew "parquet-tools"
brew "pipenv"
brew "poppler"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "sbt"
brew "screen"
brew "sf-pwgen"
brew "shellcheck"
brew "sops"
brew "sox"
brew "ssh-copy-id"
brew "tcpdump"
brew "telnet"
brew "terraform_landscape"
brew "terragrunt"
brew "tfenv", link: false
brew "the_silver_searcher"
brew "thrift"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim", args: ["with-client-server", "with-luajit"]
brew "watch"
brew "wget", args: ["with-gpgme"]
brew "whois"
brew "zlib"
brew "zsh"
brew "argoproj/tap/argo"
brew "azure/draft/draft"
brew "lampepfl/brew/dotty"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "atom"
cask "betterzip"
cask "caffeine"
cask "charles"
cask "chefdk"
cask "consul-cli"
cask "dash"
cask "datagrip"
cask "dbeaver-community"
cask "diffmerge"
cask "docker"
cask "drop-to-gif"
cask "eclipse-java"
cask "firefox"
cask "gimp"
cask "gitter"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-drive"
cask "hyperswitch"
cask "insomnia"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "karabiner"
cask "libreoffice"
cask "licecap"
cask "meld"
cask "microsoft-office"
cask "minikube"
cask "muzzle"
cask "openconnect-gui"
cask "osxfuse"
cask "postman"
cask "pritunl"
cask "rq"
cask "screenhero"
cask "signal"
cask "sketch"
cask "skype"
cask "slack"
cask "snowflake-snowsql"
cask "soapui"
cask "sourcetree"
cask "spectacle"
cask "squirrelsql"
cask "switchresx"
cask "textmate"
cask "toggldesktop"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "vmware-fusion"
cask "zoomus"
mas "1Password", id: 443987910
mas "Disk Expert", id: 488920185
mas "Microsoft Remote Desktop", id: 715768417
mas "MindNode", id: 992076693
mas "OmniGraffle", id: 1142578753
mas "Power JSON Editor", id: 499768540
mas "ScreenFlow", id: 1107828211
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
