cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"

# Core dependencies
cask "java"
cask "xquartz"

# Command line apps to install via Homebrew
brew "adns"
brew "adwaita-icon-theme"
brew "ansible"
brew "apache-spark"
brew "argo"
brew "asciinema"
brew "asciinema2gif"
brew "atk"
brew "autoconf"
brew "automake"
brew "avro-tools"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "bc"
brew "bfg"
brew "blueutil"
brew "boost"
brew "bzip2"
brew "cairo"
brew "cfssl"
brew "cloc"
brew "clojure"
brew "cmake"
brew "coreutils"
brew "csvkit"
brew "curl"
brew "diffstat"
brew "diffutils"
brew "docker"
brew "dos2unix"
brew "dotty"
brew "draft"
brew "dvm"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "emacs"
brew "expect"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "flac"
brew "fontconfig"
brew "freetype"
brew "fribidi"
brew "gdb"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gifsicle"
brew "git"
brew "glib"
brew "gmp"
brew "gnome-icon-theme"
brew "gnu-sed"
brew "gnu-tar"
brew "gnumeric"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "goffice"
brew "gpatch"
brew "gpg-agent"
brew "gpgme"
brew "gradle"
brew "grafana"
brew "graphicsmagick"
brew "graphite2"
brew "grep"
brew "groff"
brew "groovy"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gzip"
brew "harfbuzz"
brew "haskell-stack"
brew "heroku"
brew "hicolor-icon-theme"
brew "htop"
brew "httpie"
brew "hubflow"
brew "icu4c"
brew "imagemagick"
brew "jasper"
brew "jemalloc"
brew "jenv"
brew "jpeg"
brew "jq"
brew "kafkacat"
brew "kops"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "lame"
brew "leiningen"
brew "less"
brew "libassuan"
brew "libcroco"
brew "libepoxy"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libgsf"
brew "libidn2"
brew "libksba"
brew "libmagic"
brew "libogg"
brew "libpng"
brew "librdkafka"
brew "librsvg"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "little-cms2"
brew "llvm@4"
brew "lsof"
brew "lua"
brew "luajit"
brew "lz4"
brew "lzlib"
brew "mad"
brew "make"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "minimesos"
brew "minio"
brew "minio-mc"
brew "moreutils"
brew "msgpack"
brew "nano"
brew "ncurses"
brew "neovim"
brew "nettle"
brew "node"
brew "npth"
brew "nspr"
brew "nss"
brew "oniguruma"
brew "openconnect"
brew "openjpeg"
brew "openssl"
brew "opus"
brew "p11-kit"
brew "p7zip"
brew "packer"
brew "pango"
brew "parquet-tools"
brew "pcre"
brew "pcre2"
brew "perl"
brew "phantomjs"
brew "pinentry"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "poppler"
brew "pth"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "python@2"
brew "rarian"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "sbt"
brew "screen"
brew "sdl2"
brew "sf-pwgen"
brew "shared-mime-info"
brew "shellcheck"
brew "snappy"
brew "sops"
brew "sox"
brew "sqlite"
brew "ssh-copy-id"
brew "tcpdump"
brew "telnet"
brew "terraform"
brew "terraform_landscape"
brew "terragrunt"
brew "tfenv"
brew "the_silver_searcher"
brew "theora"
brew "thrift"
brew "tmux"
brew "tree"
brew "unibilium"
brew "unrar"
brew "unzip"
brew "vim", args: ["with-client-server", "with-luajit"]
brew "watch"
brew "webp"
brew "wget", args: ["with-gpgme"]
brew "whois"
brew "x264"
brew "x265"
brew "xvid"
brew "xz"
brew "yajl"
brew "zlib"
brew "zsh"

# Desktop apps to install via Cask
cask "1password-cli"
cask "adobe-creative-cloud"
cask "atom"
cask "betterzip"
cask "caffeine"
cask "charles"
cask "chefdk"
cask "consul-cli"
cask "dash"
cask "datagrip"
cask "dbeaver-community"
cask "diffmerge"
cask "docker"
cask "drop-to-gif"
cask "eclipse-java"
cask "firefox"
cask "gimp"
cask "gitter"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-drive"
cask "hyperswitch"
cask "insomnia"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "java8"
cask "karabiner"
cask "libreoffice"
cask "licecap"
cask "meld"
cask "microsoft-office"
cask "minikube"
cask "muzzle"
cask "openconnect-gui"
cask "osxfuse"
cask "postman"
cask "pritunl"
cask "rq"
cask "screenhero"
cask "signal"
cask "sketch"
cask "skype"
cask "slack"
cask "snowflake-snowsql"
cask "soapui"
cask "sourcetree"
cask "spectacle"
cask "squirrelsql"
cask "switchresx"
cask "textmate"
cask "toggldesktop"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
cask "zoomus"

# Desktop apps to install via Mac App Store
mas "1Password", id: 443987910
mas "Disk Expert", id: 488920185
mas "Microsoft Remote Desktop", id: 715768417
mas "Mindnode 2", id: 992076693
mas "Omnigraffle 7", id: 1142578753
mas "Power JSON Editor", id: 499768540
mas "Screenflow 6", id: 1107828211
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Spark - Email App by Readdle", id: 1176895641
